# Итерация 1: Используем официальный, легкий образ Python
FROM python:3.11-slim

# Итерация 2: Устанавливаем рабочую директорию внутри контейнера
WORKDIR /app

# Итерация 3: Копируем только файл с зависимостями и устанавливаем их
# Это лучший способ использовать кэширование Docker. Если зависимости не меняются,
# Docker не будет переустанавливать их при каждой сборке.
COPY requirements.txt .
RUN pip install --no-cache-dir -r requirements.txt

# Итерация 4: Копируем все остальные файлы проекта в рабочую директорию
COPY . .

# Итерация 5: Сообщаем Docker, что наше приложение будет слушать порт 8501
EXPOSE 8501

# Итерация 6: Команда, которая будет выполняться при запуске контейнера
CMD ["streamlit", "run", "app.py"]